espressif/esp-idf/components/soc/esp32s31/register/soc/lp_system_reg.h
/**
 * SPDX-FileCopyrightText: 2025 Espressif Systems (Shanghai) CO LTD
 *
 *  SPDX-License-Identifier: Apache-2.0 OR MIT
 */
#pragma once

#include "soc/soc.h"
#ifdef __cplusplus
extern "C" {
#endif

/** LP_SYSTEM_REG_VER_DATE_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_VER_DATE_REG (DR_REG_LP_SYS_BASE + 0x0)
/** LP_SYSTEM_REG_VER_DATE : R/W; bitpos: [31:0]; default: 539298083;
 *  need_des
 */
#define LP_SYSTEM_REG_VER_DATE    0xFFFFFFFFU
#define LP_SYSTEM_REG_VER_DATE_M  (LP_SYSTEM_REG_VER_DATE_V << LP_SYSTEM_REG_VER_DATE_S)
#define LP_SYSTEM_REG_VER_DATE_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_VER_DATE_S  0

/** LP_SYSTEM_REG_CLK_SEL_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_CLK_SEL_CTRL_REG (DR_REG_LP_SYS_BASE + 0x4)
/** LP_SYSTEM_REG_ENA_SW_SEL_SYS_CLK : R/W; bitpos: [16]; default: 0;
 *  reserved
 */
#define LP_SYSTEM_REG_ENA_SW_SEL_SYS_CLK    (BIT(16))
#define LP_SYSTEM_REG_ENA_SW_SEL_SYS_CLK_M  (LP_SYSTEM_REG_ENA_SW_SEL_SYS_CLK_V << LP_SYSTEM_REG_ENA_SW_SEL_SYS_CLK_S)
#define LP_SYSTEM_REG_ENA_SW_SEL_SYS_CLK_V  0x00000001U
#define LP_SYSTEM_REG_ENA_SW_SEL_SYS_CLK_S  16
/** LP_SYSTEM_REG_SW_SYS_CLK_SRC_SEL : R/W; bitpos: [17]; default: 0;
 *  reserved
 */
#define LP_SYSTEM_REG_SW_SYS_CLK_SRC_SEL    (BIT(17))
#define LP_SYSTEM_REG_SW_SYS_CLK_SRC_SEL_M  (LP_SYSTEM_REG_SW_SYS_CLK_SRC_SEL_V << LP_SYSTEM_REG_SW_SYS_CLK_SRC_SEL_S)
#define LP_SYSTEM_REG_SW_SYS_CLK_SRC_SEL_V  0x00000001U
#define LP_SYSTEM_REG_SW_SYS_CLK_SRC_SEL_S  17

/** LP_SYSTEM_REG_SYS_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_SYS_CTRL_REG (DR_REG_LP_SYS_BASE + 0x8)
/** LP_SYSTEM_REG_LP_CORE_DISABLE : R/W; bitpos: [0]; default: 0;
 *  lp cpu disable
 */
#define LP_SYSTEM_REG_LP_CORE_DISABLE    (BIT(0))
#define LP_SYSTEM_REG_LP_CORE_DISABLE_M  (LP_SYSTEM_REG_LP_CORE_DISABLE_V << LP_SYSTEM_REG_LP_CORE_DISABLE_S)
#define LP_SYSTEM_REG_LP_CORE_DISABLE_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_DISABLE_S  0
/** LP_SYSTEM_REG_SYS_SW_RST : WT; bitpos: [1]; default: 0;
 *  digital system software reset bit
 */
#define LP_SYSTEM_REG_SYS_SW_RST    (BIT(1))
#define LP_SYSTEM_REG_SYS_SW_RST_M  (LP_SYSTEM_REG_SYS_SW_RST_V << LP_SYSTEM_REG_SYS_SW_RST_S)
#define LP_SYSTEM_REG_SYS_SW_RST_V  0x00000001U
#define LP_SYSTEM_REG_SYS_SW_RST_S  1
/** LP_SYSTEM_REG_FORCE_DOWNLOAD_BOOT : R/W; bitpos: [2]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_FORCE_DOWNLOAD_BOOT    (BIT(2))
#define LP_SYSTEM_REG_FORCE_DOWNLOAD_BOOT_M  (LP_SYSTEM_REG_FORCE_DOWNLOAD_BOOT_V << LP_SYSTEM_REG_FORCE_DOWNLOAD_BOOT_S)
#define LP_SYSTEM_REG_FORCE_DOWNLOAD_BOOT_V  0x00000001U
#define LP_SYSTEM_REG_FORCE_DOWNLOAD_BOOT_S  2
/** LP_SYSTEM_REG_DIG_FIB : R/W; bitpos: [10:3]; default: 255;
 *  need_des
 */
#define LP_SYSTEM_REG_DIG_FIB    0x000000FFU
#define LP_SYSTEM_REG_DIG_FIB_M  (LP_SYSTEM_REG_DIG_FIB_V << LP_SYSTEM_REG_DIG_FIB_S)
#define LP_SYSTEM_REG_DIG_FIB_V  0x000000FFU
#define LP_SYSTEM_REG_DIG_FIB_S  3
/** LP_SYSTEM_REG_IO_MUX_RESET_DISABLE : R/W; bitpos: [11]; default: 0;
 *  reset disable bit for LP IOMUX
 */
#define LP_SYSTEM_REG_IO_MUX_RESET_DISABLE    (BIT(11))
#define LP_SYSTEM_REG_IO_MUX_RESET_DISABLE_M  (LP_SYSTEM_REG_IO_MUX_RESET_DISABLE_V << LP_SYSTEM_REG_IO_MUX_RESET_DISABLE_S)
#define LP_SYSTEM_REG_IO_MUX_RESET_DISABLE_V  0x00000001U
#define LP_SYSTEM_REG_IO_MUX_RESET_DISABLE_S  11
/** LP_SYSTEM_REG_ANA_FIB : RO; bitpos: [20:14]; default: 127;
 *  need_des
 */
#define LP_SYSTEM_REG_ANA_FIB    0x0000007FU
#define LP_SYSTEM_REG_ANA_FIB_M  (LP_SYSTEM_REG_ANA_FIB_V << LP_SYSTEM_REG_ANA_FIB_S)
#define LP_SYSTEM_REG_ANA_FIB_V  0x0000007FU
#define LP_SYSTEM_REG_ANA_FIB_S  14
/** LP_SYSTEM_REG_LP_FIB_SEL : R/W; bitpos: [28:21]; default: 255;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_FIB_SEL    0x000000FFU
#define LP_SYSTEM_REG_LP_FIB_SEL_M  (LP_SYSTEM_REG_LP_FIB_SEL_V << LP_SYSTEM_REG_LP_FIB_SEL_S)
#define LP_SYSTEM_REG_LP_FIB_SEL_V  0x000000FFU
#define LP_SYSTEM_REG_LP_FIB_SEL_S  21
/** LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_CLR : WT; bitpos: [29]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_CLR    (BIT(29))
#define LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_CLR_M  (LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_CLR_V << LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_CLR_S)
#define LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_CLR_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_CLR_S  29
/** LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG : R/WTC/SS; bitpos: [30]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG    (BIT(30))
#define LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_M  (LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_V << LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_S)
#define LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_ETM_WAKEUP_FLAG_S  30
/** LP_SYSTEM_REG_SYSTIMER_STALL_SEL : R/W; bitpos: [31]; default: 0;
 *  0: use systimer_stall signal from hp_core0, 1: use systimer_stall signal from
 *  hp_core1
 */
#define LP_SYSTEM_REG_SYSTIMER_STALL_SEL    (BIT(31))
#define LP_SYSTEM_REG_SYSTIMER_STALL_SEL_M  (LP_SYSTEM_REG_SYSTIMER_STALL_SEL_V << LP_SYSTEM_REG_SYSTIMER_STALL_SEL_S)
#define LP_SYSTEM_REG_SYSTIMER_STALL_SEL_V  0x00000001U
#define LP_SYSTEM_REG_SYSTIMER_STALL_SEL_S  31

/** LP_SYSTEM_REG_LP_CLK_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CLK_CTRL_REG (DR_REG_LP_SYS_BASE + 0xc)
/** LP_SYSTEM_REG_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  need_des
 */
#define LP_SYSTEM_REG_CLK_EN    (BIT(0))
#define LP_SYSTEM_REG_CLK_EN_M  (LP_SYSTEM_REG_CLK_EN_V << LP_SYSTEM_REG_CLK_EN_S)
#define LP_SYSTEM_REG_CLK_EN_V  0x00000001U
#define LP_SYSTEM_REG_CLK_EN_S  0
/** LP_SYSTEM_REG_LP_FOSC_HP_CKEN : R/W; bitpos: [14]; default: 1;
 *  reserved
 */
#define LP_SYSTEM_REG_LP_FOSC_HP_CKEN    (BIT(14))
#define LP_SYSTEM_REG_LP_FOSC_HP_CKEN_M  (LP_SYSTEM_REG_LP_FOSC_HP_CKEN_V << LP_SYSTEM_REG_LP_FOSC_HP_CKEN_S)
#define LP_SYSTEM_REG_LP_FOSC_HP_CKEN_V  0x00000001U
#define LP_SYSTEM_REG_LP_FOSC_HP_CKEN_S  14

/** LP_SYSTEM_REG_LP_CORE_BOOT_ADDR_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CORE_BOOT_ADDR_REG (DR_REG_LP_SYS_BASE + 0x18)
/** LP_SYSTEM_REG_LP_CPU_BOOT_ADDR : R/W; bitpos: [31:0]; default: 771751936;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CPU_BOOT_ADDR    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_CPU_BOOT_ADDR_M  (LP_SYSTEM_REG_LP_CPU_BOOT_ADDR_V << LP_SYSTEM_REG_LP_CPU_BOOT_ADDR_S)
#define LP_SYSTEM_REG_LP_CPU_BOOT_ADDR_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_CPU_BOOT_ADDR_S  0

/** LP_SYSTEM_REG_EXT_WAKEUP1_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_EXT_WAKEUP1_REG (DR_REG_LP_SYS_BASE + 0x1c)
/** LP_SYSTEM_REG_EXT_WAKEUP1_SEL : R/W; bitpos: [7:0]; default: 0;
 *  Bitmap to select RTC pads for ext wakeup1
 */
#define LP_SYSTEM_REG_EXT_WAKEUP1_SEL    0x000000FFU
#define LP_SYSTEM_REG_EXT_WAKEUP1_SEL_M  (LP_SYSTEM_REG_EXT_WAKEUP1_SEL_V << LP_SYSTEM_REG_EXT_WAKEUP1_SEL_S)
#define LP_SYSTEM_REG_EXT_WAKEUP1_SEL_V  0x000000FFU
#define LP_SYSTEM_REG_EXT_WAKEUP1_SEL_S  0
/** LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_CLR : WT; bitpos: [8]; default: 0;
 *  clear ext wakeup1 status
 */
#define LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_CLR    (BIT(8))
#define LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_CLR_M  (LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_CLR_V << LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_CLR_S)
#define LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_CLR_V  0x00000001U
#define LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_CLR_S  8

/** LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_REG (DR_REG_LP_SYS_BASE + 0x20)
/** LP_SYSTEM_REG_EXT_WAKEUP1_STATUS : RO; bitpos: [7:0]; default: 0;
 *  ext wakeup1 status
 */
#define LP_SYSTEM_REG_EXT_WAKEUP1_STATUS    0x000000FFU
#define LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_M  (LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_V << LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_S)
#define LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_V  0x000000FFU
#define LP_SYSTEM_REG_EXT_WAKEUP1_STATUS_S  0

/** LP_SYSTEM_REG_LP_TCM_PWR_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_PWR_CTRL_REG (DR_REG_LP_SYS_BASE + 0x24)
/** LP_SYSTEM_REG_LP_TCM_ROM_CLK_FORCE_ON : R/W; bitpos: [5]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_ROM_CLK_FORCE_ON    (BIT(5))
#define LP_SYSTEM_REG_LP_TCM_ROM_CLK_FORCE_ON_M  (LP_SYSTEM_REG_LP_TCM_ROM_CLK_FORCE_ON_V << LP_SYSTEM_REG_LP_TCM_ROM_CLK_FORCE_ON_S)
#define LP_SYSTEM_REG_LP_TCM_ROM_CLK_FORCE_ON_V  0x00000001U
#define LP_SYSTEM_REG_LP_TCM_ROM_CLK_FORCE_ON_S  5
/** LP_SYSTEM_REG_LP_TCM_RAM_CLK_FORCE_ON : R/W; bitpos: [7]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_RAM_CLK_FORCE_ON    (BIT(7))
#define LP_SYSTEM_REG_LP_TCM_RAM_CLK_FORCE_ON_M  (LP_SYSTEM_REG_LP_TCM_RAM_CLK_FORCE_ON_V << LP_SYSTEM_REG_LP_TCM_RAM_CLK_FORCE_ON_S)
#define LP_SYSTEM_REG_LP_TCM_RAM_CLK_FORCE_ON_V  0x00000001U
#define LP_SYSTEM_REG_LP_TCM_RAM_CLK_FORCE_ON_S  7

/** LP_SYSTEM_REG_BOOT_ADDR_HP_LP_REG_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_BOOT_ADDR_HP_LP_REG_REG (DR_REG_LP_SYS_BASE + 0x28)
/** LP_SYSTEM_REG_BOOT_ADDR_HP_LP : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_BOOT_ADDR_HP_LP    0xFFFFFFFFU
#define LP_SYSTEM_REG_BOOT_ADDR_HP_LP_M  (LP_SYSTEM_REG_BOOT_ADDR_HP_LP_V << LP_SYSTEM_REG_BOOT_ADDR_HP_LP_S)
#define LP_SYSTEM_REG_BOOT_ADDR_HP_LP_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_BOOT_ADDR_HP_LP_S  0

/** LP_SYSTEM_REG_LP_STORE0_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_STORE0_REG (DR_REG_LP_SYS_BASE + 0x2c)
/** LP_SYSTEM_REG_LP_SCRATCH0 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_SCRATCH0    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH0_M  (LP_SYSTEM_REG_LP_SCRATCH0_V << LP_SYSTEM_REG_LP_SCRATCH0_S)
#define LP_SYSTEM_REG_LP_SCRATCH0_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH0_S  0

/** LP_SYSTEM_REG_LP_STORE1_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_STORE1_REG (DR_REG_LP_SYS_BASE + 0x30)
/** LP_SYSTEM_REG_LP_SCRATCH1 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_SCRATCH1    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH1_M  (LP_SYSTEM_REG_LP_SCRATCH1_V << LP_SYSTEM_REG_LP_SCRATCH1_S)
#define LP_SYSTEM_REG_LP_SCRATCH1_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH1_S  0

/** LP_SYSTEM_REG_LP_STORE2_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_STORE2_REG (DR_REG_LP_SYS_BASE + 0x34)
/** LP_SYSTEM_REG_LP_SCRATCH2 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_SCRATCH2    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH2_M  (LP_SYSTEM_REG_LP_SCRATCH2_V << LP_SYSTEM_REG_LP_SCRATCH2_S)
#define LP_SYSTEM_REG_LP_SCRATCH2_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH2_S  0

