espressif/esp-idf/components/soc/esp32s31/register/soc/lp_system_reg.h
/** LP_SYSTEM_REG_LP_STORE3_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_STORE3_REG (DR_REG_LP_SYS_BASE + 0x38)
/** LP_SYSTEM_REG_LP_SCRATCH3 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_SCRATCH3    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH3_M  (LP_SYSTEM_REG_LP_SCRATCH3_V << LP_SYSTEM_REG_LP_SCRATCH3_S)
#define LP_SYSTEM_REG_LP_SCRATCH3_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH3_S  0

/** LP_SYSTEM_REG_LP_STORE4_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_STORE4_REG (DR_REG_LP_SYS_BASE + 0x3c)
/** LP_SYSTEM_REG_LP_SCRATCH4 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_SCRATCH4    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH4_M  (LP_SYSTEM_REG_LP_SCRATCH4_V << LP_SYSTEM_REG_LP_SCRATCH4_S)
#define LP_SYSTEM_REG_LP_SCRATCH4_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH4_S  0

/** LP_SYSTEM_REG_LP_STORE5_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_STORE5_REG (DR_REG_LP_SYS_BASE + 0x40)
/** LP_SYSTEM_REG_LP_SCRATCH5 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_SCRATCH5    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH5_M  (LP_SYSTEM_REG_LP_SCRATCH5_V << LP_SYSTEM_REG_LP_SCRATCH5_S)
#define LP_SYSTEM_REG_LP_SCRATCH5_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH5_S  0

/** LP_SYSTEM_REG_LP_STORE6_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_STORE6_REG (DR_REG_LP_SYS_BASE + 0x44)
/** LP_SYSTEM_REG_LP_SCRATCH6 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_SCRATCH6    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH6_M  (LP_SYSTEM_REG_LP_SCRATCH6_V << LP_SYSTEM_REG_LP_SCRATCH6_S)
#define LP_SYSTEM_REG_LP_SCRATCH6_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH6_S  0

/** LP_SYSTEM_REG_LP_STORE7_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_STORE7_REG (DR_REG_LP_SYS_BASE + 0x48)
/** LP_SYSTEM_REG_LP_SCRATCH7 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_SCRATCH7    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH7_M  (LP_SYSTEM_REG_LP_SCRATCH7_V << LP_SYSTEM_REG_LP_SCRATCH7_S)
#define LP_SYSTEM_REG_LP_SCRATCH7_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH7_S  0

/** LP_SYSTEM_REG_LP_STORE8_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_STORE8_REG (DR_REG_LP_SYS_BASE + 0x4c)
/** LP_SYSTEM_REG_LP_SCRATCH8 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_SCRATCH8    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH8_M  (LP_SYSTEM_REG_LP_SCRATCH8_V << LP_SYSTEM_REG_LP_SCRATCH8_S)
#define LP_SYSTEM_REG_LP_SCRATCH8_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH8_S  0

/** LP_SYSTEM_REG_LP_STORE9_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_STORE9_REG (DR_REG_LP_SYS_BASE + 0x50)
/** LP_SYSTEM_REG_LP_SCRATCH9 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_SCRATCH9    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH9_M  (LP_SYSTEM_REG_LP_SCRATCH9_V << LP_SYSTEM_REG_LP_SCRATCH9_S)
#define LP_SYSTEM_REG_LP_SCRATCH9_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH9_S  0

/** LP_SYSTEM_REG_LP_STORE10_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_STORE10_REG (DR_REG_LP_SYS_BASE + 0x54)
/** LP_SYSTEM_REG_LP_SCRATCH10 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_SCRATCH10    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH10_M  (LP_SYSTEM_REG_LP_SCRATCH10_V << LP_SYSTEM_REG_LP_SCRATCH10_S)
#define LP_SYSTEM_REG_LP_SCRATCH10_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH10_S  0

/** LP_SYSTEM_REG_LP_STORE11_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_STORE11_REG (DR_REG_LP_SYS_BASE + 0x58)
/** LP_SYSTEM_REG_LP_SCRATCH11 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_SCRATCH11    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH11_M  (LP_SYSTEM_REG_LP_SCRATCH11_V << LP_SYSTEM_REG_LP_SCRATCH11_S)
#define LP_SYSTEM_REG_LP_SCRATCH11_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH11_S  0

/** LP_SYSTEM_REG_LP_STORE12_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_STORE12_REG (DR_REG_LP_SYS_BASE + 0x5c)
/** LP_SYSTEM_REG_LP_SCRATCH12 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_SCRATCH12    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH12_M  (LP_SYSTEM_REG_LP_SCRATCH12_V << LP_SYSTEM_REG_LP_SCRATCH12_S)
#define LP_SYSTEM_REG_LP_SCRATCH12_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH12_S  0

/** LP_SYSTEM_REG_LP_STORE13_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_STORE13_REG (DR_REG_LP_SYS_BASE + 0x60)
/** LP_SYSTEM_REG_LP_SCRATCH13 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_SCRATCH13    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH13_M  (LP_SYSTEM_REG_LP_SCRATCH13_V << LP_SYSTEM_REG_LP_SCRATCH13_S)
#define LP_SYSTEM_REG_LP_SCRATCH13_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH13_S  0

/** LP_SYSTEM_REG_LP_STORE14_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_STORE14_REG (DR_REG_LP_SYS_BASE + 0x64)
/** LP_SYSTEM_REG_LP_SCRATCH14 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_SCRATCH14    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH14_M  (LP_SYSTEM_REG_LP_SCRATCH14_V << LP_SYSTEM_REG_LP_SCRATCH14_S)
#define LP_SYSTEM_REG_LP_SCRATCH14_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH14_S  0

/** LP_SYSTEM_REG_LP_STORE15_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_STORE15_REG (DR_REG_LP_SYS_BASE + 0x68)
/** LP_SYSTEM_REG_LP_SCRATCH15 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_SCRATCH15    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH15_M  (LP_SYSTEM_REG_LP_SCRATCH15_V << LP_SYSTEM_REG_LP_SCRATCH15_S)
#define LP_SYSTEM_REG_LP_SCRATCH15_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_SCRATCH15_S  0

/** LP_SYSTEM_REG_LP_PROBEA_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_PROBEA_CTRL_REG (DR_REG_LP_SYS_BASE + 0x6c)
/** LP_SYSTEM_REG_PROBE_A_MOD_SEL : R/W; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_PROBE_A_MOD_SEL    0x0000FFFFU
#define LP_SYSTEM_REG_PROBE_A_MOD_SEL_M  (LP_SYSTEM_REG_PROBE_A_MOD_SEL_V << LP_SYSTEM_REG_PROBE_A_MOD_SEL_S)
#define LP_SYSTEM_REG_PROBE_A_MOD_SEL_V  0x0000FFFFU
#define LP_SYSTEM_REG_PROBE_A_MOD_SEL_S  0
/** LP_SYSTEM_REG_PROBE_A_TOP_SEL : R/W; bitpos: [23:16]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_PROBE_A_TOP_SEL    0x000000FFU
#define LP_SYSTEM_REG_PROBE_A_TOP_SEL_M  (LP_SYSTEM_REG_PROBE_A_TOP_SEL_V << LP_SYSTEM_REG_PROBE_A_TOP_SEL_S)
#define LP_SYSTEM_REG_PROBE_A_TOP_SEL_V  0x000000FFU
#define LP_SYSTEM_REG_PROBE_A_TOP_SEL_S  16
/** LP_SYSTEM_REG_PROBE_L_SEL : R/W; bitpos: [25:24]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_PROBE_L_SEL    0x00000003U
#define LP_SYSTEM_REG_PROBE_L_SEL_M  (LP_SYSTEM_REG_PROBE_L_SEL_V << LP_SYSTEM_REG_PROBE_L_SEL_S)
#define LP_SYSTEM_REG_PROBE_L_SEL_V  0x00000003U
#define LP_SYSTEM_REG_PROBE_L_SEL_S  24
/** LP_SYSTEM_REG_PROBE_H_SEL : R/W; bitpos: [27:26]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_PROBE_H_SEL    0x00000003U
#define LP_SYSTEM_REG_PROBE_H_SEL_M  (LP_SYSTEM_REG_PROBE_H_SEL_V << LP_SYSTEM_REG_PROBE_H_SEL_S)
#define LP_SYSTEM_REG_PROBE_H_SEL_V  0x00000003U
#define LP_SYSTEM_REG_PROBE_H_SEL_S  26
/** LP_SYSTEM_REG_PROBE_GLOBAL_EN : R/W; bitpos: [28]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_PROBE_GLOBAL_EN    (BIT(28))
#define LP_SYSTEM_REG_PROBE_GLOBAL_EN_M  (LP_SYSTEM_REG_PROBE_GLOBAL_EN_V << LP_SYSTEM_REG_PROBE_GLOBAL_EN_S)
#define LP_SYSTEM_REG_PROBE_GLOBAL_EN_V  0x00000001U
#define LP_SYSTEM_REG_PROBE_GLOBAL_EN_S  28

/** LP_SYSTEM_REG_LP_PROBEB_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_PROBEB_CTRL_REG (DR_REG_LP_SYS_BASE + 0x70)
/** LP_SYSTEM_REG_PROBE_B_MOD_SEL : R/W; bitpos: [15:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_PROBE_B_MOD_SEL    0x0000FFFFU
#define LP_SYSTEM_REG_PROBE_B_MOD_SEL_M  (LP_SYSTEM_REG_PROBE_B_MOD_SEL_V << LP_SYSTEM_REG_PROBE_B_MOD_SEL_S)
#define LP_SYSTEM_REG_PROBE_B_MOD_SEL_V  0x0000FFFFU
#define LP_SYSTEM_REG_PROBE_B_MOD_SEL_S  0
/** LP_SYSTEM_REG_PROBE_B_TOP_SEL : R/W; bitpos: [23:16]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_PROBE_B_TOP_SEL    0x000000FFU
#define LP_SYSTEM_REG_PROBE_B_TOP_SEL_M  (LP_SYSTEM_REG_PROBE_B_TOP_SEL_V << LP_SYSTEM_REG_PROBE_B_TOP_SEL_S)
#define LP_SYSTEM_REG_PROBE_B_TOP_SEL_V  0x000000FFU
#define LP_SYSTEM_REG_PROBE_B_TOP_SEL_S  16
/** LP_SYSTEM_REG_PROBE_B_EN : R/W; bitpos: [24]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_PROBE_B_EN    (BIT(24))
#define LP_SYSTEM_REG_PROBE_B_EN_M  (LP_SYSTEM_REG_PROBE_B_EN_V << LP_SYSTEM_REG_PROBE_B_EN_S)
#define LP_SYSTEM_REG_PROBE_B_EN_V  0x00000001U
#define LP_SYSTEM_REG_PROBE_B_EN_S  24

