espressif/esp-idf/components/soc/esp32s31/register/soc/lp_system_reg.h
/** LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_LOW_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_LOW_REG (DR_REG_LP_SYS_BASE + 0x120)
/** LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_LOW : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_LOW    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_LOW_M  (LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_LOW_V << LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_LOW_S)
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_LOW_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_LOW_S  0

/** LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_HIGH_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_HIGH_REG (DR_REG_LP_SYS_BASE + 0x124)
/** LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_HIGH : R/W; bitpos: [31:0]; default: 4294967295;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_HIGH    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_HIGH_M  (LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_HIGH_V << LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_HIGH_S)
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_HIGH_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_TCM_ROM_RDN_ECO_HIGH_S  0

/** LP_SYSTEM_REG_HP_ROOT_CLK_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_HP_ROOT_CLK_CTRL_REG (DR_REG_LP_SYS_BASE + 0x130)
/** LP_SYSTEM_REG_CPU_CLK_EN : R/W; bitpos: [0]; default: 1;
 *  clock gate enable for hp cpu root 400M clk
 */
#define LP_SYSTEM_REG_CPU_CLK_EN    (BIT(0))
#define LP_SYSTEM_REG_CPU_CLK_EN_M  (LP_SYSTEM_REG_CPU_CLK_EN_V << LP_SYSTEM_REG_CPU_CLK_EN_S)
#define LP_SYSTEM_REG_CPU_CLK_EN_V  0x00000001U
#define LP_SYSTEM_REG_CPU_CLK_EN_S  0
/** LP_SYSTEM_REG_SYS_CLK_EN : R/W; bitpos: [1]; default: 1;
 *  clock gate enable for hp sys root 480M clk
 */
#define LP_SYSTEM_REG_SYS_CLK_EN    (BIT(1))
#define LP_SYSTEM_REG_SYS_CLK_EN_M  (LP_SYSTEM_REG_SYS_CLK_EN_V << LP_SYSTEM_REG_SYS_CLK_EN_S)
#define LP_SYSTEM_REG_SYS_CLK_EN_V  0x00000001U
#define LP_SYSTEM_REG_SYS_CLK_EN_S  1

/** LP_SYSTEM_REG_LP_PMU_RDN_ECO_LOW_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_PMU_RDN_ECO_LOW_REG (DR_REG_LP_SYS_BASE + 0x138)
/** LP_SYSTEM_REG_PMU_RDN_ECO_LOW : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_PMU_RDN_ECO_LOW    0xFFFFFFFFU
#define LP_SYSTEM_REG_PMU_RDN_ECO_LOW_M  (LP_SYSTEM_REG_PMU_RDN_ECO_LOW_V << LP_SYSTEM_REG_PMU_RDN_ECO_LOW_S)
#define LP_SYSTEM_REG_PMU_RDN_ECO_LOW_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_PMU_RDN_ECO_LOW_S  0

/** LP_SYSTEM_REG_LP_PMU_RDN_ECO_HIGH_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_PMU_RDN_ECO_HIGH_REG (DR_REG_LP_SYS_BASE + 0x13c)
/** LP_SYSTEM_REG_PMU_RDN_ECO_HIGH : R/W; bitpos: [31:0]; default: 4294967295;
 *  need_des
 */
#define LP_SYSTEM_REG_PMU_RDN_ECO_HIGH    0xFFFFFFFFU
#define LP_SYSTEM_REG_PMU_RDN_ECO_HIGH_M  (LP_SYSTEM_REG_PMU_RDN_ECO_HIGH_V << LP_SYSTEM_REG_PMU_RDN_ECO_HIGH_S)
#define LP_SYSTEM_REG_PMU_RDN_ECO_HIGH_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_PMU_RDN_ECO_HIGH_S  0

/** LP_SYSTEM_REG_BACKUP_DMA_CFG0_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_BACKUP_DMA_CFG0_REG (DR_REG_LP_SYS_BASE + 0x154)
/** LP_SYSTEM_REG_BURST_LIMIT_AON : R/W; bitpos: [4:0]; default: 10;
 *  Set this field to configure max value of burst in signal transfer.
 */
#define LP_SYSTEM_REG_BURST_LIMIT_AON    0x0000001FU
#define LP_SYSTEM_REG_BURST_LIMIT_AON_M  (LP_SYSTEM_REG_BURST_LIMIT_AON_V << LP_SYSTEM_REG_BURST_LIMIT_AON_S)
#define LP_SYSTEM_REG_BURST_LIMIT_AON_V  0x0000001FU
#define LP_SYSTEM_REG_BURST_LIMIT_AON_S  0
/** LP_SYSTEM_REG_READ_INTERVAL_AON : R/W; bitpos: [11:5]; default: 10;
 *  Set this field to configure read registers' interval time in reading mode.
 */
#define LP_SYSTEM_REG_READ_INTERVAL_AON    0x0000007FU
#define LP_SYSTEM_REG_READ_INTERVAL_AON_M  (LP_SYSTEM_REG_READ_INTERVAL_AON_V << LP_SYSTEM_REG_READ_INTERVAL_AON_S)
#define LP_SYSTEM_REG_READ_INTERVAL_AON_V  0x0000007FU
#define LP_SYSTEM_REG_READ_INTERVAL_AON_S  5
/** LP_SYSTEM_REG_LINK_BACKUP_TOUT_THRES_AON : R/W; bitpos: [21:12]; default: 100;
 *  Set this field to configure maximum waiting time in backup mode.
 */
#define LP_SYSTEM_REG_LINK_BACKUP_TOUT_THRES_AON    0x000003FFU
#define LP_SYSTEM_REG_LINK_BACKUP_TOUT_THRES_AON_M  (LP_SYSTEM_REG_LINK_BACKUP_TOUT_THRES_AON_V << LP_SYSTEM_REG_LINK_BACKUP_TOUT_THRES_AON_S)
#define LP_SYSTEM_REG_LINK_BACKUP_TOUT_THRES_AON_V  0x000003FFU
#define LP_SYSTEM_REG_LINK_BACKUP_TOUT_THRES_AON_S  12
/** LP_SYSTEM_REG_REGDMA_ERROR : RO; bitpos: [24:22]; default: 0;
 *  regdma error code
 */
#define LP_SYSTEM_REG_REGDMA_ERROR    0x00000007U
#define LP_SYSTEM_REG_REGDMA_ERROR_M  (LP_SYSTEM_REG_REGDMA_ERROR_V << LP_SYSTEM_REG_REGDMA_ERROR_S)
#define LP_SYSTEM_REG_REGDMA_ERROR_V  0x00000007U
#define LP_SYSTEM_REG_REGDMA_ERROR_S  22

/** LP_SYSTEM_REG_BACKUP_DMA_CFG1_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_BACKUP_DMA_CFG1_REG (DR_REG_LP_SYS_BASE + 0x158)
/** LP_SYSTEM_REG_LINK_WAIT_TOUT_THRES_AON : R/W; bitpos: [9:0]; default: 100;
 *  Set this field to configure the number of consecutive links of link list.
 */
#define LP_SYSTEM_REG_LINK_WAIT_TOUT_THRES_AON    0x000003FFU
#define LP_SYSTEM_REG_LINK_WAIT_TOUT_THRES_AON_M  (LP_SYSTEM_REG_LINK_WAIT_TOUT_THRES_AON_V << LP_SYSTEM_REG_LINK_WAIT_TOUT_THRES_AON_S)
#define LP_SYSTEM_REG_LINK_WAIT_TOUT_THRES_AON_V  0x000003FFU
#define LP_SYSTEM_REG_LINK_WAIT_TOUT_THRES_AON_S  0
/** LP_SYSTEM_REG_LINK_WORK_TOUT_THRES_AON : R/W; bitpos: [19:10]; default: 100;
 *  Set this field to configure maximum waiting time in waiting mode.
 */
#define LP_SYSTEM_REG_LINK_WORK_TOUT_THRES_AON    0x000003FFU
#define LP_SYSTEM_REG_LINK_WORK_TOUT_THRES_AON_M  (LP_SYSTEM_REG_LINK_WORK_TOUT_THRES_AON_V << LP_SYSTEM_REG_LINK_WORK_TOUT_THRES_AON_S)
#define LP_SYSTEM_REG_LINK_WORK_TOUT_THRES_AON_V  0x000003FFU
#define LP_SYSTEM_REG_LINK_WORK_TOUT_THRES_AON_S  10
/** LP_SYSTEM_REG_BRANCH_LINK_LENGTH_AON : R/W; bitpos: [23:20]; default: 0;
 *  Set this field to configure link address.
 */
#define LP_SYSTEM_REG_BRANCH_LINK_LENGTH_AON    0x0000000FU
#define LP_SYSTEM_REG_BRANCH_LINK_LENGTH_AON_M  (LP_SYSTEM_REG_BRANCH_LINK_LENGTH_AON_V << LP_SYSTEM_REG_BRANCH_LINK_LENGTH_AON_S)
#define LP_SYSTEM_REG_BRANCH_LINK_LENGTH_AON_V  0x0000000FU
#define LP_SYSTEM_REG_BRANCH_LINK_LENGTH_AON_S  20
/** LP_SYSTEM_REG_AON_BYPASS : R/W; bitpos: [31]; default: 0;
 *  unused
 */
#define LP_SYSTEM_REG_AON_BYPASS    (BIT(31))
#define LP_SYSTEM_REG_AON_BYPASS_M  (LP_SYSTEM_REG_AON_BYPASS_V << LP_SYSTEM_REG_AON_BYPASS_S)
#define LP_SYSTEM_REG_AON_BYPASS_V  0x00000001U
#define LP_SYSTEM_REG_AON_BYPASS_S  31

/** LP_SYSTEM_REG_BACKUP_DMA_CFG2_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_BACKUP_DMA_CFG2_REG (DR_REG_LP_SYS_BASE + 0x15c)
/** LP_SYSTEM_REG_LINK_ADDR_AON : R/W; bitpos: [31:0]; default: 0;
 *  Set this field to configure link address.
 */
#define LP_SYSTEM_REG_LINK_ADDR_AON    0xFFFFFFFFU
#define LP_SYSTEM_REG_LINK_ADDR_AON_M  (LP_SYSTEM_REG_LINK_ADDR_AON_V << LP_SYSTEM_REG_LINK_ADDR_AON_S)
#define LP_SYSTEM_REG_LINK_ADDR_AON_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LINK_ADDR_AON_S  0

