espressif/esp-idf/components/soc/esp32s31/register/soc/lp_system_reg.h
/** LP_SYSTEM_REG_BOOT_ADDR_HP_CORE1_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_BOOT_ADDR_HP_CORE1_REG (DR_REG_LP_SYS_BASE + 0x164)
/** LP_SYSTEM_REG_BOOT_ADDR_HP_CORE1 : R/W; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_BOOT_ADDR_HP_CORE1    0xFFFFFFFFU
#define LP_SYSTEM_REG_BOOT_ADDR_HP_CORE1_M  (LP_SYSTEM_REG_BOOT_ADDR_HP_CORE1_V << LP_SYSTEM_REG_BOOT_ADDR_HP_CORE1_S)
#define LP_SYSTEM_REG_BOOT_ADDR_HP_CORE1_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_BOOT_ADDR_HP_CORE1_S  0

/** LP_SYSTEM_REG_INT_RAW_REG register
 *  raw interrupt register
 */
#define LP_SYSTEM_REG_INT_RAW_REG (DR_REG_LP_SYS_BASE + 0x170)
/** LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_RAW : R/SS/WTC; bitpos: [3]; default: 0;
 *  the raw interrupt status of lp core  ibus timeout
 */
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_RAW    (BIT(3))
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_RAW_M  (LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_RAW_V << LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_RAW_S)
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_RAW_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_RAW_S  3
/** LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_RAW : R/SS/WTC; bitpos: [4]; default: 0;
 *  the raw interrupt status of lp core  dbus timeout
 */
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_RAW    (BIT(4))
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_RAW_M  (LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_RAW_V << LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_RAW_S)
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_RAW_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_RAW_S  4
/** LP_SYSTEM_REG_ETM_TASK_ULP_INT_RAW : R/SS/WTC; bitpos: [5]; default: 0;
 *  the raw interrupt status of etm task ulp
 */
#define LP_SYSTEM_REG_ETM_TASK_ULP_INT_RAW    (BIT(5))
#define LP_SYSTEM_REG_ETM_TASK_ULP_INT_RAW_M  (LP_SYSTEM_REG_ETM_TASK_ULP_INT_RAW_V << LP_SYSTEM_REG_ETM_TASK_ULP_INT_RAW_S)
#define LP_SYSTEM_REG_ETM_TASK_ULP_INT_RAW_V  0x00000001U
#define LP_SYSTEM_REG_ETM_TASK_ULP_INT_RAW_S  5
/** LP_SYSTEM_REG_SLOW_CLK_TICK_INT_RAW : R/SS/WTC; bitpos: [6]; default: 0;
 *  the raw interrupt status of slow_clk_tick
 */
#define LP_SYSTEM_REG_SLOW_CLK_TICK_INT_RAW    (BIT(6))
#define LP_SYSTEM_REG_SLOW_CLK_TICK_INT_RAW_M  (LP_SYSTEM_REG_SLOW_CLK_TICK_INT_RAW_V << LP_SYSTEM_REG_SLOW_CLK_TICK_INT_RAW_S)
#define LP_SYSTEM_REG_SLOW_CLK_TICK_INT_RAW_V  0x00000001U
#define LP_SYSTEM_REG_SLOW_CLK_TICK_INT_RAW_S  6

/** LP_SYSTEM_REG_INT_ST_REG register
 *  masked interrupt register
 */
#define LP_SYSTEM_REG_INT_ST_REG (DR_REG_LP_SYS_BASE + 0x174)
/** LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_ST : RO; bitpos: [3]; default: 0;
 *  the masked interrupt status of lp core  ibus timeout
 */
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_ST    (BIT(3))
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_ST_M  (LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_ST_V << LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_ST_S)
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_ST_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_ST_S  3
/** LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_ST : RO; bitpos: [4]; default: 0;
 *  the masked interrupt status of lp core  dbus timeout
 */
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_ST    (BIT(4))
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_ST_M  (LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_ST_V << LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_ST_S)
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_ST_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_ST_S  4
/** LP_SYSTEM_REG_ETM_TASK_ULP_INT_ST : RO; bitpos: [5]; default: 0;
 *  the masked interrupt status of etm task ulp
 */
#define LP_SYSTEM_REG_ETM_TASK_ULP_INT_ST    (BIT(5))
#define LP_SYSTEM_REG_ETM_TASK_ULP_INT_ST_M  (LP_SYSTEM_REG_ETM_TASK_ULP_INT_ST_V << LP_SYSTEM_REG_ETM_TASK_ULP_INT_ST_S)
#define LP_SYSTEM_REG_ETM_TASK_ULP_INT_ST_V  0x00000001U
#define LP_SYSTEM_REG_ETM_TASK_ULP_INT_ST_S  5
/** LP_SYSTEM_REG_SLOW_CLK_TICK_INT_ST : RO; bitpos: [6]; default: 0;
 *  the masked interrupt status of slow_clk_tick
 */
#define LP_SYSTEM_REG_SLOW_CLK_TICK_INT_ST    (BIT(6))
#define LP_SYSTEM_REG_SLOW_CLK_TICK_INT_ST_M  (LP_SYSTEM_REG_SLOW_CLK_TICK_INT_ST_V << LP_SYSTEM_REG_SLOW_CLK_TICK_INT_ST_S)
#define LP_SYSTEM_REG_SLOW_CLK_TICK_INT_ST_V  0x00000001U
#define LP_SYSTEM_REG_SLOW_CLK_TICK_INT_ST_S  6

/** LP_SYSTEM_REG_INT_ENA_REG register
 *  masked interrupt register
 */
#define LP_SYSTEM_REG_INT_ENA_REG (DR_REG_LP_SYS_BASE + 0x178)
/** LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_ENA : R/W; bitpos: [3]; default: 0;
 *  Write 1 to enable lp_core_ibus_timeout int
 */
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_ENA    (BIT(3))
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_ENA_M  (LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_ENA_V << LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_ENA_S)
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_ENA_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_ENA_S  3
/** LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_ENA : R/W; bitpos: [4]; default: 0;
 *  Write 1 to enable lp_core_dbus_timeout int
 */
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_ENA    (BIT(4))
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_ENA_M  (LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_ENA_V << LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_ENA_S)
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_ENA_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_ENA_S  4
/** LP_SYSTEM_REG_ETM_TASK_ULP_INT_ENA : R/W; bitpos: [5]; default: 0;
 *  Write 1 to enable etm task ulp int
 */
#define LP_SYSTEM_REG_ETM_TASK_ULP_INT_ENA    (BIT(5))
#define LP_SYSTEM_REG_ETM_TASK_ULP_INT_ENA_M  (LP_SYSTEM_REG_ETM_TASK_ULP_INT_ENA_V << LP_SYSTEM_REG_ETM_TASK_ULP_INT_ENA_S)
#define LP_SYSTEM_REG_ETM_TASK_ULP_INT_ENA_V  0x00000001U
#define LP_SYSTEM_REG_ETM_TASK_ULP_INT_ENA_S  5
/** LP_SYSTEM_REG_SLOW_CLK_TICK_INT_ENA : R/W; bitpos: [6]; default: 0;
 *  Write 1 to enable slow_clk_tick int
 */
#define LP_SYSTEM_REG_SLOW_CLK_TICK_INT_ENA    (BIT(6))
#define LP_SYSTEM_REG_SLOW_CLK_TICK_INT_ENA_M  (LP_SYSTEM_REG_SLOW_CLK_TICK_INT_ENA_V << LP_SYSTEM_REG_SLOW_CLK_TICK_INT_ENA_S)
#define LP_SYSTEM_REG_SLOW_CLK_TICK_INT_ENA_V  0x00000001U
#define LP_SYSTEM_REG_SLOW_CLK_TICK_INT_ENA_S  6

/** LP_SYSTEM_REG_INT_CLR_REG register
 *  interrupt clear register
 */
#define LP_SYSTEM_REG_INT_CLR_REG (DR_REG_LP_SYS_BASE + 0x17c)
/** LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_CLR : WT; bitpos: [3]; default: 0;
 *  Write 1 to clear lp_core_ibus_timeout int
 */
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_CLR    (BIT(3))
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_CLR_M  (LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_CLR_V << LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_CLR_S)
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_CLR_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_INT_CLR_S  3
/** LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_CLR : WT; bitpos: [4]; default: 0;
 *  Write 1 to clear lp_core_dbus_timeout int
 */
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_CLR    (BIT(4))
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_CLR_M  (LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_CLR_V << LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_CLR_S)
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_CLR_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_INT_CLR_S  4
/** LP_SYSTEM_REG_ETM_TASK_ULP_INT_CLR : WT; bitpos: [5]; default: 0;
 *  Write 1 to clear etm tasl ulp int
 */
#define LP_SYSTEM_REG_ETM_TASK_ULP_INT_CLR    (BIT(5))
#define LP_SYSTEM_REG_ETM_TASK_ULP_INT_CLR_M  (LP_SYSTEM_REG_ETM_TASK_ULP_INT_CLR_V << LP_SYSTEM_REG_ETM_TASK_ULP_INT_CLR_S)
#define LP_SYSTEM_REG_ETM_TASK_ULP_INT_CLR_V  0x00000001U
#define LP_SYSTEM_REG_ETM_TASK_ULP_INT_CLR_S  5
/** LP_SYSTEM_REG_SLOW_CLK_TICK_INT_CLR : WT; bitpos: [6]; default: 0;
 *  Write 1 to clear slow_clk_tick int
 */
#define LP_SYSTEM_REG_SLOW_CLK_TICK_INT_CLR    (BIT(6))
#define LP_SYSTEM_REG_SLOW_CLK_TICK_INT_CLR_M  (LP_SYSTEM_REG_SLOW_CLK_TICK_INT_CLR_V << LP_SYSTEM_REG_SLOW_CLK_TICK_INT_CLR_S)
#define LP_SYSTEM_REG_SLOW_CLK_TICK_INT_CLR_V  0x00000001U
#define LP_SYSTEM_REG_SLOW_CLK_TICK_INT_CLR_S  6

/** LP_SYSTEM_REG_SPRF_MEM_AUX_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_SPRF_MEM_AUX_CTRL_REG (DR_REG_LP_SYS_BASE + 0x180)
/** LP_SYSTEM_REG_SPRF_MEM_AUX_CTRL : R/W; bitpos: [31:0]; default: 8304;
 *  need_des
 */
#define LP_SYSTEM_REG_SPRF_MEM_AUX_CTRL    0xFFFFFFFFU
#define LP_SYSTEM_REG_SPRF_MEM_AUX_CTRL_M  (LP_SYSTEM_REG_SPRF_MEM_AUX_CTRL_V << LP_SYSTEM_REG_SPRF_MEM_AUX_CTRL_S)
#define LP_SYSTEM_REG_SPRF_MEM_AUX_CTRL_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_SPRF_MEM_AUX_CTRL_S  0

/** LP_SYSTEM_REG_LP_CPU_DBG_PC_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CPU_DBG_PC_REG (DR_REG_LP_SYS_BASE + 0x190)
/** LP_SYSTEM_REG_LP_CPU_DBG_PC : RO; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CPU_DBG_PC    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_CPU_DBG_PC_M  (LP_SYSTEM_REG_LP_CPU_DBG_PC_V << LP_SYSTEM_REG_LP_CPU_DBG_PC_S)
#define LP_SYSTEM_REG_LP_CPU_DBG_PC_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_CPU_DBG_PC_S  0

/** LP_SYSTEM_REG_LP_CPU_EXC_PC_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CPU_EXC_PC_REG (DR_REG_LP_SYS_BASE + 0x194)
/** LP_SYSTEM_REG_LP_CPU_EXC_PC : RO; bitpos: [31:0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CPU_EXC_PC    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_CPU_EXC_PC_M  (LP_SYSTEM_REG_LP_CPU_EXC_PC_V << LP_SYSTEM_REG_LP_CPU_EXC_PC_S)
#define LP_SYSTEM_REG_LP_CPU_EXC_PC_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_CPU_EXC_PC_S  0

/** LP_SYSTEM_REG_HP_POR_RST_BYPASS_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_HP_POR_RST_BYPASS_CTRL_REG (DR_REG_LP_SYS_BASE + 0x1a0)
/** LP_SYSTEM_REG_HP_PO_CPU_RSTN_BYPASS_CTRL : R/W; bitpos: [7:0]; default: 255;
 *  [7] 1'b1: po_cpu_rstn bypass sys_sw_rstn
 *  [6] 1'b1: po_cpu_rstn bypass hp_wdt_sys_rstn
 *  [5] 1'b1: po_cpu_rstn bypass hp_cpu_intrusion_rstn
 *  [4] 1'b1: po_cpu_rstn bypass hp_sdio_sys_rstn
 *  [3] 1'b1: po_cpu_rstn bypass usb_jtag_chip_rst
 *  [2] 1'b1: po_cpu_rstn bypass usb_uart_chip_rst
 *  [1] 1'b1: po_cpu_rstn bypass lp_wdt_hp_sys_rstn
 *  [0] 1'b1: po_cpu_rstn bypass efuse_err_rstn
 */
#define LP_SYSTEM_REG_HP_PO_CPU_RSTN_BYPASS_CTRL    0x000000FFU
#define LP_SYSTEM_REG_HP_PO_CPU_RSTN_BYPASS_CTRL_M  (LP_SYSTEM_REG_HP_PO_CPU_RSTN_BYPASS_CTRL_V << LP_SYSTEM_REG_HP_PO_CPU_RSTN_BYPASS_CTRL_S)
#define LP_SYSTEM_REG_HP_PO_CPU_RSTN_BYPASS_CTRL_V  0x000000FFU
#define LP_SYSTEM_REG_HP_PO_CPU_RSTN_BYPASS_CTRL_S  0
/** LP_SYSTEM_REG_HP_PO_CNNT_RSTN_BYPASS_CTRL : R/W; bitpos: [15:8]; default: 255;
 *  [15] 1'b1: po_cnnt_rstn bypass sys_sw_rstn
 *  [14] 1'b1: po_cnnt_rstn bypass hp_wdt_sys_rstn
 *  [13] 1'b1: po_cnnt_rstn bypass hp_cpu_intrusion_rstn
 *  [12] 1'b1: po_cnnt_rstn bypass hp_sdio_sys_rstn
 *  [11] 1'b1: po_cnnt_rstn bypass usb_jtag_chip_rst
 *  [10] 1'b1: po_cnnt_rstn bypass usb_uart_chip_rst
 *  [9] 1'b1: po_cnnt_rstn bypass lp_wdt_hp_sys_rstn
 *  [8] 1'b1: po_cnnt_rstn bypass efuse_err_rstn
 */
#define LP_SYSTEM_REG_HP_PO_CNNT_RSTN_BYPASS_CTRL    0x000000FFU
#define LP_SYSTEM_REG_HP_PO_CNNT_RSTN_BYPASS_CTRL_M  (LP_SYSTEM_REG_HP_PO_CNNT_RSTN_BYPASS_CTRL_V << LP_SYSTEM_REG_HP_PO_CNNT_RSTN_BYPASS_CTRL_S)
#define LP_SYSTEM_REG_HP_PO_CNNT_RSTN_BYPASS_CTRL_V  0x000000FFU
#define LP_SYSTEM_REG_HP_PO_CNNT_RSTN_BYPASS_CTRL_S  8
/** LP_SYSTEM_REG_HP_PO_ALIVE_RSTN_BYPASS_CTRL : R/W; bitpos: [23:16]; default: 255;
 *  [23] 1'b1: po_alive_rstn bypass sys_sw_rstn
 *  [22] 1'b1: po_alive_rstn bypass hp_wdt_sys_rstn
 *  [21] 1'b1: po_alive_rstn bypass hp_cpu_intrusion_rstn
 *  [20] 1'b1: po_alive_rstn bypass hp_sdio_sys_rstn
 *  [19] 1'b1: po_alive_rstn bypass usb_jtag_chip_rst
 *  [18] 1'b1: po_alive_rstn bypass usb_uart_chip_rst
 *  [17] 1'b1: po_alive_rstn bypass lp_wdt_hp_sys_rstn
 *  [16] 1'b1: po_alive_rstn bypass efuse_err_rstn
 */
#define LP_SYSTEM_REG_HP_PO_ALIVE_RSTN_BYPASS_CTRL    0x000000FFU
#define LP_SYSTEM_REG_HP_PO_ALIVE_RSTN_BYPASS_CTRL_M  (LP_SYSTEM_REG_HP_PO_ALIVE_RSTN_BYPASS_CTRL_V << LP_SYSTEM_REG_HP_PO_ALIVE_RSTN_BYPASS_CTRL_S)
#define LP_SYSTEM_REG_HP_PO_ALIVE_RSTN_BYPASS_CTRL_V  0x000000FFU
#define LP_SYSTEM_REG_HP_PO_ALIVE_RSTN_BYPASS_CTRL_S  16
/** LP_SYSTEM_REG_HP_PO_RSTN_BYPASS_CTRL : R/W; bitpos: [31:24]; default: 255;
 *  [31] 1'b1: po_rstn bypass sys_sw_rstn
 *  [30] 1'b1: po_rstn bypass hp_wdt_sys_rstn
 *  [29] 1'b1: po_rstn bypass hp_cpu_intrusion_rstn
 *  [28] 1'b1: po_rstn bypass hp_sdio_sys_rstn
 *  [27] 1'b1: po_rstn bypass usb_jtag_chip_rst
 *  [26] 1'b1: po_rstn bypass usb_uart_chip_rst
 *  [25] 1'b1: po_rstn bypass lp_wdt_hp_sys_rstn
 *  [24] 1'b1: po_rstn bypass efuse_err_rstn
 */
#define LP_SYSTEM_REG_HP_PO_RSTN_BYPASS_CTRL    0x000000FFU
#define LP_SYSTEM_REG_HP_PO_RSTN_BYPASS_CTRL_M  (LP_SYSTEM_REG_HP_PO_RSTN_BYPASS_CTRL_V << LP_SYSTEM_REG_HP_PO_RSTN_BYPASS_CTRL_S)
#define LP_SYSTEM_REG_HP_PO_RSTN_BYPASS_CTRL_V  0x000000FFU
#define LP_SYSTEM_REG_HP_PO_RSTN_BYPASS_CTRL_S  24

/** LP_SYSTEM_REG_RNG_DATA_REG register
 *  rng data register
 */
#define LP_SYSTEM_REG_RNG_DATA_REG (DR_REG_LP_SYS_BASE + 0x1a4)
/** LP_SYSTEM_REG_RND_DATA : RO; bitpos: [31:0]; default: 0;
 *  result of rng output
 */
#define LP_SYSTEM_REG_RND_DATA    0xFFFFFFFFU
#define LP_SYSTEM_REG_RND_DATA_M  (LP_SYSTEM_REG_RND_DATA_V << LP_SYSTEM_REG_RND_DATA_S)
#define LP_SYSTEM_REG_RND_DATA_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_RND_DATA_S  0

/** LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_CONF_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_CONF_REG (DR_REG_LP_SYS_BASE + 0x1b4)
/** LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_PROTECT_EN : R/W; bitpos: [0]; default: 1;
 *  set this field to 1 to enable lp core ibus timeout handle
 */
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_PROTECT_EN    (BIT(0))
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_PROTECT_EN_M  (LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_PROTECT_EN_V << LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_PROTECT_EN_S)
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_PROTECT_EN_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_PROTECT_EN_S  0
/** LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_THRES : R/W; bitpos: [16:1]; default: 65535;
 *  This field used to set lp core ibus timeout  threshold
 */
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_THRES    0x0000FFFFU
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_THRES_M  (LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_THRES_V << LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_THRES_S)
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_THRES_V  0x0000FFFFU
#define LP_SYSTEM_REG_LP_CORE_IBUS_TIMEOUT_THRES_S  1

