espressif/esp-idf/components/soc/esp32s31/register/soc/lp_system_reg.h
/** LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_CONF_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_CONF_REG (DR_REG_LP_SYS_BASE + 0x1b8)
/** LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_PROTECT_EN : R/W; bitpos: [0]; default: 1;
 *  set this field to 1 to enable lp core dbus timeout handle
 */
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_PROTECT_EN    (BIT(0))
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_PROTECT_EN_M  (LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_PROTECT_EN_V << LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_PROTECT_EN_S)
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_PROTECT_EN_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_PROTECT_EN_S  0
/** LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_THRES : R/W; bitpos: [16:1]; default: 65535;
 *  This field used to set lp core dbus timeout  threshold
 */
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_THRES    0x0000FFFFU
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_THRES_M  (LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_THRES_V << LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_THRES_S)
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_THRES_V  0x0000FFFFU
#define LP_SYSTEM_REG_LP_CORE_DBUS_TIMEOUT_THRES_S  1

/** LP_SYSTEM_REG_LP_CORE_ERR_RESP_DIS_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_LP_CORE_ERR_RESP_DIS_REG (DR_REG_LP_SYS_BASE + 0x1bc)
/** LP_SYSTEM_REG_LP_CORE_ERR_RESP_DIS : R/W; bitpos: [2:0]; default: 0;
 *  Set bit0 to disable ibus err resp;Set bit1 to disable dbus err resp; Set bit 2 to
 *  disable ahb err resp.
 */
#define LP_SYSTEM_REG_LP_CORE_ERR_RESP_DIS    0x00000007U
#define LP_SYSTEM_REG_LP_CORE_ERR_RESP_DIS_M  (LP_SYSTEM_REG_LP_CORE_ERR_RESP_DIS_V << LP_SYSTEM_REG_LP_CORE_ERR_RESP_DIS_S)
#define LP_SYSTEM_REG_LP_CORE_ERR_RESP_DIS_V  0x00000007U
#define LP_SYSTEM_REG_LP_CORE_ERR_RESP_DIS_S  0

/** LP_SYSTEM_REG_RNG_CFG_REG register
 *  rng cfg register
 */
#define LP_SYSTEM_REG_RNG_CFG_REG (DR_REG_LP_SYS_BASE + 0x1c0)
/** LP_SYSTEM_REG_RNG_TIMER_EN : R/W; bitpos: [0]; default: 1;
 *  enable rng timer
 */
#define LP_SYSTEM_REG_RNG_TIMER_EN    (BIT(0))
#define LP_SYSTEM_REG_RNG_TIMER_EN_M  (LP_SYSTEM_REG_RNG_TIMER_EN_V << LP_SYSTEM_REG_RNG_TIMER_EN_S)
#define LP_SYSTEM_REG_RNG_TIMER_EN_V  0x00000001U
#define LP_SYSTEM_REG_RNG_TIMER_EN_S  0
/** LP_SYSTEM_REG_RNG_TIMER_PSCALE : R/W; bitpos: [8:1]; default: 1;
 *  configure ng timer pscale
 */
#define LP_SYSTEM_REG_RNG_TIMER_PSCALE    0x000000FFU
#define LP_SYSTEM_REG_RNG_TIMER_PSCALE_M  (LP_SYSTEM_REG_RNG_TIMER_PSCALE_V << LP_SYSTEM_REG_RNG_TIMER_PSCALE_S)
#define LP_SYSTEM_REG_RNG_TIMER_PSCALE_V  0x000000FFU
#define LP_SYSTEM_REG_RNG_TIMER_PSCALE_S  1
/** LP_SYSTEM_REG_RNG_SAR_ENABLE : R/W; bitpos: [9]; default: 0;
 *  enable rng_saradc
 */
#define LP_SYSTEM_REG_RNG_SAR_ENABLE    (BIT(9))
#define LP_SYSTEM_REG_RNG_SAR_ENABLE_M  (LP_SYSTEM_REG_RNG_SAR_ENABLE_V << LP_SYSTEM_REG_RNG_SAR_ENABLE_S)
#define LP_SYSTEM_REG_RNG_SAR_ENABLE_V  0x00000001U
#define LP_SYSTEM_REG_RNG_SAR_ENABLE_S  9
/** LP_SYSTEM_REG_RNG_SAR_DATA : RO; bitpos: [28:16]; default: 0;
 *  debug rng sar sample cnt
 */
#define LP_SYSTEM_REG_RNG_SAR_DATA    0x00001FFFU
#define LP_SYSTEM_REG_RNG_SAR_DATA_M  (LP_SYSTEM_REG_RNG_SAR_DATA_V << LP_SYSTEM_REG_RNG_SAR_DATA_S)
#define LP_SYSTEM_REG_RNG_SAR_DATA_V  0x00001FFFU
#define LP_SYSTEM_REG_RNG_SAR_DATA_S  16

/** LP_SYSTEM_REG_PADCTRL_REG register
 *  pad ctrl register
 */
#define LP_SYSTEM_REG_PADCTRL_REG (DR_REG_LP_SYS_BASE + 0x1c4)
/** LP_SYSTEM_REG_PAD_MUX_SEL : R/W; bitpos: [7:0]; default: 0;
 *  Pad 0 ~ 7 can be controlled by hp iomux or lp iomux
 *  0: pad is controlled by hp iomux
 *  1: pad is controlled by lp iomux
 */
#define LP_SYSTEM_REG_PAD_MUX_SEL    0x000000FFU
#define LP_SYSTEM_REG_PAD_MUX_SEL_M  (LP_SYSTEM_REG_PAD_MUX_SEL_V << LP_SYSTEM_REG_PAD_MUX_SEL_S)
#define LP_SYSTEM_REG_PAD_MUX_SEL_V  0x000000FFU
#define LP_SYSTEM_REG_PAD_MUX_SEL_S  0
/** LP_SYSTEM_REG_PAD_HOLD : R/W; bitpos: [15:8]; default: 0;
 *  Pad 0 ~ 7 hold, direct control, won't be muxed with hp
 */
#define LP_SYSTEM_REG_PAD_HOLD    0x000000FFU
#define LP_SYSTEM_REG_PAD_HOLD_M  (LP_SYSTEM_REG_PAD_HOLD_V << LP_SYSTEM_REG_PAD_HOLD_S)
#define LP_SYSTEM_REG_PAD_HOLD_V  0x000000FFU
#define LP_SYSTEM_REG_PAD_HOLD_S  8

/** LP_SYSTEM_REG_SYS_POWER_STATUS_REG register
 *  lp system pd ctrl register
 */
#define LP_SYSTEM_REG_SYS_POWER_STATUS_REG (DR_REG_LP_SYS_BASE + 0x1e8)
/** LP_SYSTEM_REG_LP_TCM_RAM_PRDYN : RO; bitpos: [0]; default: 1;
 *  Record lp tcm ram power status.
 */
#define LP_SYSTEM_REG_LP_TCM_RAM_PRDYN    (BIT(0))
#define LP_SYSTEM_REG_LP_TCM_RAM_PRDYN_M  (LP_SYSTEM_REG_LP_TCM_RAM_PRDYN_V << LP_SYSTEM_REG_LP_TCM_RAM_PRDYN_S)
#define LP_SYSTEM_REG_LP_TCM_RAM_PRDYN_V  0x00000001U
#define LP_SYSTEM_REG_LP_TCM_RAM_PRDYN_S  0
/** LP_SYSTEM_REG_LP_TCM_ROM_PRDYN : RO; bitpos: [1]; default: 1;
 *  Record lp tcm rom power status.
 */
#define LP_SYSTEM_REG_LP_TCM_ROM_PRDYN    (BIT(1))
#define LP_SYSTEM_REG_LP_TCM_ROM_PRDYN_M  (LP_SYSTEM_REG_LP_TCM_ROM_PRDYN_V << LP_SYSTEM_REG_LP_TCM_ROM_PRDYN_S)
#define LP_SYSTEM_REG_LP_TCM_ROM_PRDYN_V  0x00000001U
#define LP_SYSTEM_REG_LP_TCM_ROM_PRDYN_S  1
/** LP_SYSTEM_REG_LP_HUK_MEM_PRDYN : RO; bitpos: [2]; default: 1;
 *  Record lp huk mem power status.
 */
#define LP_SYSTEM_REG_LP_HUK_MEM_PRDYN    (BIT(2))
#define LP_SYSTEM_REG_LP_HUK_MEM_PRDYN_M  (LP_SYSTEM_REG_LP_HUK_MEM_PRDYN_V << LP_SYSTEM_REG_LP_HUK_MEM_PRDYN_S)
#define LP_SYSTEM_REG_LP_HUK_MEM_PRDYN_V  0x00000001U
#define LP_SYSTEM_REG_LP_HUK_MEM_PRDYN_S  2
/** LP_SYSTEM_REG_LP_EFUSE_MEM_PRDYN : RO; bitpos: [3]; default: 1;
 *  Record lp efuse mem power status.
 */
#define LP_SYSTEM_REG_LP_EFUSE_MEM_PRDYN    (BIT(3))
#define LP_SYSTEM_REG_LP_EFUSE_MEM_PRDYN_M  (LP_SYSTEM_REG_LP_EFUSE_MEM_PRDYN_V << LP_SYSTEM_REG_LP_EFUSE_MEM_PRDYN_S)
#define LP_SYSTEM_REG_LP_EFUSE_MEM_PRDYN_V  0x00000001U
#define LP_SYSTEM_REG_LP_EFUSE_MEM_PRDYN_S  3
/** LP_SYSTEM_REG_LP_UART_MEM_PRDYN : RO; bitpos: [4]; default: 1;
 *  Record lp uart mem power status.
 */
#define LP_SYSTEM_REG_LP_UART_MEM_PRDYN    (BIT(4))
#define LP_SYSTEM_REG_LP_UART_MEM_PRDYN_M  (LP_SYSTEM_REG_LP_UART_MEM_PRDYN_V << LP_SYSTEM_REG_LP_UART_MEM_PRDYN_S)
#define LP_SYSTEM_REG_LP_UART_MEM_PRDYN_V  0x00000001U
#define LP_SYSTEM_REG_LP_UART_MEM_PRDYN_S  4

/** LP_SYSTEM_REG_ANA_DCDC_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_ANA_DCDC_REG (DR_REG_LP_SYS_BASE + 0x1ec)
/** LP_SYSTEM_REG_RAMPLEVEL_DCDC : HRO; bitpos: [0]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_RAMPLEVEL_DCDC    (BIT(0))
#define LP_SYSTEM_REG_RAMPLEVEL_DCDC_M  (LP_SYSTEM_REG_RAMPLEVEL_DCDC_V << LP_SYSTEM_REG_RAMPLEVEL_DCDC_S)
#define LP_SYSTEM_REG_RAMPLEVEL_DCDC_V  0x00000001U
#define LP_SYSTEM_REG_RAMPLEVEL_DCDC_S  0
/** LP_SYSTEM_REG_RAMP_DCDC : HRO; bitpos: [1]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_RAMP_DCDC    (BIT(1))
#define LP_SYSTEM_REG_RAMP_DCDC_M  (LP_SYSTEM_REG_RAMP_DCDC_V << LP_SYSTEM_REG_RAMP_DCDC_S)
#define LP_SYSTEM_REG_RAMP_DCDC_V  0x00000001U
#define LP_SYSTEM_REG_RAMP_DCDC_S  1
/** LP_SYSTEM_REG_DCM2ENB_DCDC : HRO; bitpos: [2]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_DCM2ENB_DCDC    (BIT(2))
#define LP_SYSTEM_REG_DCM2ENB_DCDC_M  (LP_SYSTEM_REG_DCM2ENB_DCDC_V << LP_SYSTEM_REG_DCM2ENB_DCDC_S)
#define LP_SYSTEM_REG_DCM2ENB_DCDC_V  0x00000001U
#define LP_SYSTEM_REG_DCM2ENB_DCDC_S  2
/** LP_SYSTEM_REG_DCMLEVEL_DCDC : HRO; bitpos: [4:3]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_DCMLEVEL_DCDC    0x00000003U
#define LP_SYSTEM_REG_DCMLEVEL_DCDC_M  (LP_SYSTEM_REG_DCMLEVEL_DCDC_V << LP_SYSTEM_REG_DCMLEVEL_DCDC_S)
#define LP_SYSTEM_REG_DCMLEVEL_DCDC_V  0x00000003U
#define LP_SYSTEM_REG_DCMLEVEL_DCDC_S  3
/** LP_SYSTEM_REG_FSW_DCDC : HRO; bitpos: [7:5]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_FSW_DCDC    0x00000007U
#define LP_SYSTEM_REG_FSW_DCDC_M  (LP_SYSTEM_REG_FSW_DCDC_V << LP_SYSTEM_REG_FSW_DCDC_S)
#define LP_SYSTEM_REG_FSW_DCDC_V  0x00000007U
#define LP_SYSTEM_REG_FSW_DCDC_S  5
/** LP_SYSTEM_REG_CCM_DCDC : HRO; bitpos: [8]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_CCM_DCDC    (BIT(8))
#define LP_SYSTEM_REG_CCM_DCDC_M  (LP_SYSTEM_REG_CCM_DCDC_V << LP_SYSTEM_REG_CCM_DCDC_S)
#define LP_SYSTEM_REG_CCM_DCDC_V  0x00000001U
#define LP_SYSTEM_REG_CCM_DCDC_S  8
/** LP_SYSTEM_REG_SSTIME_DCDC : HRO; bitpos: [9]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_SSTIME_DCDC    (BIT(9))
#define LP_SYSTEM_REG_SSTIME_DCDC_M  (LP_SYSTEM_REG_SSTIME_DCDC_V << LP_SYSTEM_REG_SSTIME_DCDC_S)
#define LP_SYSTEM_REG_SSTIME_DCDC_V  0x00000001U
#define LP_SYSTEM_REG_SSTIME_DCDC_S  9
/** LP_SYSTEM_REG_POCPENB_DCDC : HRO; bitpos: [10]; default: 0;
 *  need_des
 */
#define LP_SYSTEM_REG_POCPENB_DCDC    (BIT(10))
#define LP_SYSTEM_REG_POCPENB_DCDC_M  (LP_SYSTEM_REG_POCPENB_DCDC_V << LP_SYSTEM_REG_POCPENB_DCDC_S)
#define LP_SYSTEM_REG_POCPENB_DCDC_V  0x00000001U
#define LP_SYSTEM_REG_POCPENB_DCDC_S  10
/** LP_SYSTEM_REG_ENABLE_TRX_MODE_DCDC : HRO; bitpos: [11]; default: 1;
 *  need_des
 */
#define LP_SYSTEM_REG_ENABLE_TRX_MODE_DCDC    (BIT(11))
#define LP_SYSTEM_REG_ENABLE_TRX_MODE_DCDC_M  (LP_SYSTEM_REG_ENABLE_TRX_MODE_DCDC_V << LP_SYSTEM_REG_ENABLE_TRX_MODE_DCDC_S)
#define LP_SYSTEM_REG_ENABLE_TRX_MODE_DCDC_V  0x00000001U
#define LP_SYSTEM_REG_ENABLE_TRX_MODE_DCDC_S  11

/** LP_SYSTEM_REG_POR_CUR_ST_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_POR_CUR_ST_REG (DR_REG_LP_SYS_BASE + 0x1f0)
/** LP_SYSTEM_REG_POR_CUR_ST : RO; bitpos: [8:0]; default: 0;
 *  current por state
 */
#define LP_SYSTEM_REG_POR_CUR_ST    0x000001FFU
#define LP_SYSTEM_REG_POR_CUR_ST_M  (LP_SYSTEM_REG_POR_CUR_ST_V << LP_SYSTEM_REG_POR_CUR_ST_S)
#define LP_SYSTEM_REG_POR_CUR_ST_V  0x000001FFU
#define LP_SYSTEM_REG_POR_CUR_ST_S  0

/** LP_SYSTEM_REG_SPRAM_MEM_AUX_CTRL_REG register
 *  need_des
 */
#define LP_SYSTEM_REG_SPRAM_MEM_AUX_CTRL_REG (DR_REG_LP_SYS_BASE + 0x1f8)
/** LP_SYSTEM_REG_SPRAM_MEM_AUX_CTRL : R/W; bitpos: [31:0]; default: 8304;
 *  need_des
 */
#define LP_SYSTEM_REG_SPRAM_MEM_AUX_CTRL    0xFFFFFFFFU
#define LP_SYSTEM_REG_SPRAM_MEM_AUX_CTRL_M  (LP_SYSTEM_REG_SPRAM_MEM_AUX_CTRL_V << LP_SYSTEM_REG_SPRAM_MEM_AUX_CTRL_S)
#define LP_SYSTEM_REG_SPRAM_MEM_AUX_CTRL_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_SPRAM_MEM_AUX_CTRL_S  0

/** LP_SYSTEM_REG_UART_MEM_LP_CTRL_REG register
 *  config lp peri memory power in lp aon register
 */
#define LP_SYSTEM_REG_UART_MEM_LP_CTRL_REG (DR_REG_LP_SYS_BASE + 0x1fc)
/** LP_SYSTEM_REG_UART_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 2;
 *  Configures lp uart memory low power mode in low power stage.
 *  0: deep sleep
 *  1: light sleep
 *  2(default): shut down
 *  3: disable low power stage
 */
#define LP_SYSTEM_REG_UART_MEM_LP_MODE    0x00000003U
#define LP_SYSTEM_REG_UART_MEM_LP_MODE_M  (LP_SYSTEM_REG_UART_MEM_LP_MODE_V << LP_SYSTEM_REG_UART_MEM_LP_MODE_S)
#define LP_SYSTEM_REG_UART_MEM_LP_MODE_V  0x00000003U
#define LP_SYSTEM_REG_UART_MEM_LP_MODE_S  0
/** LP_SYSTEM_REG_UART_MEM_LP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down lp uart memory.
 */
#define LP_SYSTEM_REG_UART_MEM_LP_EN    (BIT(2))
#define LP_SYSTEM_REG_UART_MEM_LP_EN_M  (LP_SYSTEM_REG_UART_MEM_LP_EN_V << LP_SYSTEM_REG_UART_MEM_LP_EN_S)
#define LP_SYSTEM_REG_UART_MEM_LP_EN_V  0x00000001U
#define LP_SYSTEM_REG_UART_MEM_LP_EN_S  2
/** LP_SYSTEM_REG_UART_MEM_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control lp uart memory, disable hardware control.
 */
#define LP_SYSTEM_REG_UART_MEM_LP_FORCE_CTRL    (BIT(3))
#define LP_SYSTEM_REG_UART_MEM_LP_FORCE_CTRL_M  (LP_SYSTEM_REG_UART_MEM_LP_FORCE_CTRL_V << LP_SYSTEM_REG_UART_MEM_LP_FORCE_CTRL_S)
#define LP_SYSTEM_REG_UART_MEM_LP_FORCE_CTRL_V  0x00000001U
#define LP_SYSTEM_REG_UART_MEM_LP_FORCE_CTRL_S  3

