espressif/esp-idf/components/soc/esp32s31/register/soc/lp_system_reg.h
/** LP_SYSTEM_REG_HUK_MEM_LP_CTRL_REG register
 *  config lp peri memory power in lp aon register
 */
#define LP_SYSTEM_REG_HUK_MEM_LP_CTRL_REG (DR_REG_LP_SYS_BASE + 0x200)
/** LP_SYSTEM_REG_HUK_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 0;
 *  Configures huk memory low power mode in low power stage.
 *  0: deep sleep
 *  1: light sleep
 *  2(default): shut down
 *  3: disable low power stage
 */
#define LP_SYSTEM_REG_HUK_MEM_LP_MODE    0x00000003U
#define LP_SYSTEM_REG_HUK_MEM_LP_MODE_M  (LP_SYSTEM_REG_HUK_MEM_LP_MODE_V << LP_SYSTEM_REG_HUK_MEM_LP_MODE_S)
#define LP_SYSTEM_REG_HUK_MEM_LP_MODE_V  0x00000003U
#define LP_SYSTEM_REG_HUK_MEM_LP_MODE_S  0
/** LP_SYSTEM_REG_HUK_MEM_LP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down huk memory.
 */
#define LP_SYSTEM_REG_HUK_MEM_LP_EN    (BIT(2))
#define LP_SYSTEM_REG_HUK_MEM_LP_EN_M  (LP_SYSTEM_REG_HUK_MEM_LP_EN_V << LP_SYSTEM_REG_HUK_MEM_LP_EN_S)
#define LP_SYSTEM_REG_HUK_MEM_LP_EN_V  0x00000001U
#define LP_SYSTEM_REG_HUK_MEM_LP_EN_S  2
/** LP_SYSTEM_REG_HUK_MEM_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control huk memory, disable hardware control.
 */
#define LP_SYSTEM_REG_HUK_MEM_LP_FORCE_CTRL    (BIT(3))
#define LP_SYSTEM_REG_HUK_MEM_LP_FORCE_CTRL_M  (LP_SYSTEM_REG_HUK_MEM_LP_FORCE_CTRL_V << LP_SYSTEM_REG_HUK_MEM_LP_FORCE_CTRL_S)
#define LP_SYSTEM_REG_HUK_MEM_LP_FORCE_CTRL_V  0x00000001U
#define LP_SYSTEM_REG_HUK_MEM_LP_FORCE_CTRL_S  3

/** LP_SYSTEM_REG_EFUSE_MEM_LP_CTRL_REG register
 *  config lp peri memory power in lp aon register
 */
#define LP_SYSTEM_REG_EFUSE_MEM_LP_CTRL_REG (DR_REG_LP_SYS_BASE + 0x204)
/** LP_SYSTEM_REG_EFUSE_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 0;
 *  Configures efuse memory low power mode in low power stage.
 *  0(default): deep sleep
 *  1: light sleep
 *  2: shut down
 *  3: disable low power stage
 */
#define LP_SYSTEM_REG_EFUSE_MEM_LP_MODE    0x00000003U
#define LP_SYSTEM_REG_EFUSE_MEM_LP_MODE_M  (LP_SYSTEM_REG_EFUSE_MEM_LP_MODE_V << LP_SYSTEM_REG_EFUSE_MEM_LP_MODE_S)
#define LP_SYSTEM_REG_EFUSE_MEM_LP_MODE_V  0x00000003U
#define LP_SYSTEM_REG_EFUSE_MEM_LP_MODE_S  0
/** LP_SYSTEM_REG_EFUSE_MEM_LP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down efuse memory.
 */
#define LP_SYSTEM_REG_EFUSE_MEM_LP_EN    (BIT(2))
#define LP_SYSTEM_REG_EFUSE_MEM_LP_EN_M  (LP_SYSTEM_REG_EFUSE_MEM_LP_EN_V << LP_SYSTEM_REG_EFUSE_MEM_LP_EN_S)
#define LP_SYSTEM_REG_EFUSE_MEM_LP_EN_V  0x00000001U
#define LP_SYSTEM_REG_EFUSE_MEM_LP_EN_S  2
/** LP_SYSTEM_REG_EFUSE_MEM_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control efuse memory, disable hardware control.
 */
#define LP_SYSTEM_REG_EFUSE_MEM_LP_FORCE_CTRL    (BIT(3))
#define LP_SYSTEM_REG_EFUSE_MEM_LP_FORCE_CTRL_M  (LP_SYSTEM_REG_EFUSE_MEM_LP_FORCE_CTRL_V << LP_SYSTEM_REG_EFUSE_MEM_LP_FORCE_CTRL_S)
#define LP_SYSTEM_REG_EFUSE_MEM_LP_FORCE_CTRL_V  0x00000001U
#define LP_SYSTEM_REG_EFUSE_MEM_LP_FORCE_CTRL_S  3

/** LP_SYSTEM_REG_LP_TCM_MEM_LP_CTRL_REG register
 *  configure rmemory power in lp system register
 */
#define LP_SYSTEM_REG_LP_TCM_MEM_LP_CTRL_REG (DR_REG_LP_SYS_BASE + 0x208)
/** LP_SYSTEM_REG_LP_TCM_MEM_LP_MODE : R/W; bitpos: [1:0]; default: 0;
 *  Configures lp_sram memory low power mode in low power stage.
 *  0(default): deep sleep
 *  1: light sleep
 *  2: shut down
 *  3: disable low power stage
 */
#define LP_SYSTEM_REG_LP_TCM_MEM_LP_MODE    0x00000003U
#define LP_SYSTEM_REG_LP_TCM_MEM_LP_MODE_M  (LP_SYSTEM_REG_LP_TCM_MEM_LP_MODE_V << LP_SYSTEM_REG_LP_TCM_MEM_LP_MODE_S)
#define LP_SYSTEM_REG_LP_TCM_MEM_LP_MODE_V  0x00000003U
#define LP_SYSTEM_REG_LP_TCM_MEM_LP_MODE_S  0
/** LP_SYSTEM_REG_LP_TCM_MEM_LP_EN : R/W; bitpos: [2]; default: 0;
 *  Set this bit to power down lp_sram memory.
 */
#define LP_SYSTEM_REG_LP_TCM_MEM_LP_EN    (BIT(2))
#define LP_SYSTEM_REG_LP_TCM_MEM_LP_EN_M  (LP_SYSTEM_REG_LP_TCM_MEM_LP_EN_V << LP_SYSTEM_REG_LP_TCM_MEM_LP_EN_S)
#define LP_SYSTEM_REG_LP_TCM_MEM_LP_EN_V  0x00000001U
#define LP_SYSTEM_REG_LP_TCM_MEM_LP_EN_S  2
/** LP_SYSTEM_REG_LP_TCM_MEM_LP_FORCE_CTRL : R/W; bitpos: [3]; default: 0;
 *  Set this bit to force software control lp_sram memory, disable hardware control.
 */
#define LP_SYSTEM_REG_LP_TCM_MEM_LP_FORCE_CTRL    (BIT(3))
#define LP_SYSTEM_REG_LP_TCM_MEM_LP_FORCE_CTRL_M  (LP_SYSTEM_REG_LP_TCM_MEM_LP_FORCE_CTRL_V << LP_SYSTEM_REG_LP_TCM_MEM_LP_FORCE_CTRL_S)
#define LP_SYSTEM_REG_LP_TCM_MEM_LP_FORCE_CTRL_V  0x00000001U
#define LP_SYSTEM_REG_LP_TCM_MEM_LP_FORCE_CTRL_S  3

/** LP_SYSTEM_REG_MODEM_MEM_CLK_SEL_REG register
 *  configure clock source for modme_mem, this register must be config by regdma when
 *  power on
 */
#define LP_SYSTEM_REG_MODEM_MEM_CLK_SEL_REG (DR_REG_LP_SYS_BASE + 0x218)
/** LP_SYSTEM_REG_MODEM_MEM_CLK_SEL : R/W; bitpos: [0]; default: 0;
 *  configure clock source for modme_mem, this register must be config by regdma when
 *  power on
 */
#define LP_SYSTEM_REG_MODEM_MEM_CLK_SEL    (BIT(0))
#define LP_SYSTEM_REG_MODEM_MEM_CLK_SEL_M  (LP_SYSTEM_REG_MODEM_MEM_CLK_SEL_V << LP_SYSTEM_REG_MODEM_MEM_CLK_SEL_S)
#define LP_SYSTEM_REG_MODEM_MEM_CLK_SEL_V  0x00000001U
#define LP_SYSTEM_REG_MODEM_MEM_CLK_SEL_S  0

/** LP_SYSTEM_REG_LP_PERI_TIMEOUT_CONF_REG register
 *  LP_PERI_TIMEOUT configuration register
 */
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_CONF_REG (DR_REG_LP_SYS_BASE + 0x21c)
/** LP_SYSTEM_REG_LP_PERI_TIMEOUT_THRES : R/W; bitpos: [15:0]; default: 65535;
 *  Configures the timeout threshold for bus access for accessing CPU peripheral
 *  register in the number of clock cycles of the clock domain.
 */
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_THRES    0x0000FFFFU
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_THRES_M  (LP_SYSTEM_REG_LP_PERI_TIMEOUT_THRES_V << LP_SYSTEM_REG_LP_PERI_TIMEOUT_THRES_S)
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_THRES_V  0x0000FFFFU
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_THRES_S  0
/** LP_SYSTEM_REG_LP_PERI_TIMEOUT_INT_CLEAR : WT; bitpos: [16]; default: 0;
 *  Write 1 to clear timeout interrupt.
 */
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_INT_CLEAR    (BIT(16))
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_INT_CLEAR_M  (LP_SYSTEM_REG_LP_PERI_TIMEOUT_INT_CLEAR_V << LP_SYSTEM_REG_LP_PERI_TIMEOUT_INT_CLEAR_S)
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_INT_CLEAR_V  0x00000001U
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_INT_CLEAR_S  16
/** LP_SYSTEM_REG_LP_PERI_TIMEOUT_PROTECT_EN : R/W; bitpos: [17]; default: 1;
 *  Configures whether or not to enable timeout protection for accessing CPU peripheral
 *  registers.
 *  0: Disable
 *  1: Enable
 */
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_PROTECT_EN    (BIT(17))
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_PROTECT_EN_M  (LP_SYSTEM_REG_LP_PERI_TIMEOUT_PROTECT_EN_V << LP_SYSTEM_REG_LP_PERI_TIMEOUT_PROTECT_EN_S)
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_PROTECT_EN_V  0x00000001U
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_PROTECT_EN_S  17

/** LP_SYSTEM_REG_LP_PERI_TIMEOUT_ADDR_REG register
 *  LP_PERI_TIMEOUT_ADDR register
 */
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_ADDR_REG (DR_REG_LP_SYS_BASE + 0x220)
/** LP_SYSTEM_REG_LP_PERI_TIMEOUT_ADDR : RO; bitpos: [31:0]; default: 0;
 *  Represents the address information of abnormal access.
 */
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_ADDR    0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_ADDR_M  (LP_SYSTEM_REG_LP_PERI_TIMEOUT_ADDR_V << LP_SYSTEM_REG_LP_PERI_TIMEOUT_ADDR_S)
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_ADDR_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_ADDR_S  0

/** LP_SYSTEM_REG_LP_PERI_TIMEOUT_UID_REG register
 *  LP_PERI_TIMEOUT_UID register
 */
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_UID_REG (DR_REG_LP_SYS_BASE + 0x224)
/** LP_SYSTEM_REG_LP_PERI_TIMEOUT_UID : RO; bitpos: [7:0]; default: 0;
 *  Represents the master id[5:0] and master permission[6:5] when trigger timeout. This
 *  register will be cleared after the interrupt is cleared.
 */
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_UID    0x000000FFU
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_UID_M  (LP_SYSTEM_REG_LP_PERI_TIMEOUT_UID_V << LP_SYSTEM_REG_LP_PERI_TIMEOUT_UID_S)
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_UID_V  0x000000FFU
#define LP_SYSTEM_REG_LP_PERI_TIMEOUT_UID_S  0

