espressif/esp-idf/components/soc/esp32s31/register/soc/lp_system_reg.h
/** LP_SYSTEM_REG_RTC_EN_AMUX_REG register
 *  RTC_EN_AMUX register
 */
#define LP_SYSTEM_REG_RTC_EN_AMUX_REG (DR_REG_LP_SYS_BASE + 0x228)
/** LP_SYSTEM_REG_RTC_EN_AMUX : R/W; bitpos: [17:0]; default: 0;
 *  Configures the rtc_en_amux of the pad in hp_pad_top
 */
#define LP_SYSTEM_REG_RTC_EN_AMUX    0x0003FFFFU
#define LP_SYSTEM_REG_RTC_EN_AMUX_M  (LP_SYSTEM_REG_RTC_EN_AMUX_V << LP_SYSTEM_REG_RTC_EN_AMUX_S)
#define LP_SYSTEM_REG_RTC_EN_AMUX_V  0x0003FFFFU
#define LP_SYSTEM_REG_RTC_EN_AMUX_S  0

/** LP_SYSTEM_REG_RTC_EN_DMUX_REG register
 *  RTC_EN_DMUX register
 */
#define LP_SYSTEM_REG_RTC_EN_DMUX_REG (DR_REG_LP_SYS_BASE + 0x22c)
/** LP_SYSTEM_REG_RTC_EN_DMUX : R/W; bitpos: [1:0]; default: 0;
 *  Configures the rtc_en_dmux of the pad(digmux) in hp_pad_top
 */
#define LP_SYSTEM_REG_RTC_EN_DMUX    0x00000003U
#define LP_SYSTEM_REG_RTC_EN_DMUX_M  (LP_SYSTEM_REG_RTC_EN_DMUX_V << LP_SYSTEM_REG_RTC_EN_DMUX_S)
#define LP_SYSTEM_REG_RTC_EN_DMUX_V  0x00000003U
#define LP_SYSTEM_REG_RTC_EN_DMUX_S  0

/** LP_SYSTEM_REG_DIGMUX_PAD_DSEL_REG register
 *  DIGMUX_PAD_DSEL register
 */
#define LP_SYSTEM_REG_DIGMUX_PAD_DSEL_REG (DR_REG_LP_SYS_BASE + 0x230)
/** LP_SYSTEM_REG_DIGMUX_PAD_DSEL : R/W; bitpos: [5:0]; default: 0;
 *  Configures the rtc_en_dmux of the pad(digmux) in hp_pad_top
 */
#define LP_SYSTEM_REG_DIGMUX_PAD_DSEL    0x0000003FU
#define LP_SYSTEM_REG_DIGMUX_PAD_DSEL_M  (LP_SYSTEM_REG_DIGMUX_PAD_DSEL_V << LP_SYSTEM_REG_DIGMUX_PAD_DSEL_S)
#define LP_SYSTEM_REG_DIGMUX_PAD_DSEL_V  0x0000003FU
#define LP_SYSTEM_REG_DIGMUX_PAD_DSEL_S  0

/** LP_SYSTEM_REG_JTAG_TDIO_MUX_SEL_REG register
 *  LP_JTAG_TDIO_MUX_SEL register
 */
#define LP_SYSTEM_REG_JTAG_TDIO_MUX_SEL_REG (DR_REG_LP_SYS_BASE + 0x234)
/** LP_SYSTEM_REG_JTAG_TDIO_MUX_SEL : R/W; bitpos: [1:0]; default: 0;
 *  Bit[0] selects the jtdi source for lp_core, 1'h0: from tdo of the hp_core; 1'h1:
 *  from pad tdi(lp_core on, hp_core off)
 *  Bit[1] selects the jtdo source for usj_mux, 1'h0: from tdo of the lp_core; 1'h1:
 *  from tdi of the lp_core(lp_core off, hp_core on)
 */
#define LP_SYSTEM_REG_JTAG_TDIO_MUX_SEL    0x00000003U
#define LP_SYSTEM_REG_JTAG_TDIO_MUX_SEL_M  (LP_SYSTEM_REG_JTAG_TDIO_MUX_SEL_V << LP_SYSTEM_REG_JTAG_TDIO_MUX_SEL_S)
#define LP_SYSTEM_REG_JTAG_TDIO_MUX_SEL_V  0x00000003U
#define LP_SYSTEM_REG_JTAG_TDIO_MUX_SEL_S  0

/** LP_SYSTEM_REG_LP_CORE_DMACTIVE_LPCORE_REG register
 *  LP_JTAG_TDI_SEL register
 */
#define LP_SYSTEM_REG_LP_CORE_DMACTIVE_LPCORE_REG (DR_REG_LP_SYS_BASE + 0x238)
/** LP_SYSTEM_REG_LP_CORE_DMACTIVE_LPCORE : RO; bitpos: [0]; default: 0;
 *  Record lpcore_dmactive_lpcore status
 */
#define LP_SYSTEM_REG_LP_CORE_DMACTIVE_LPCORE    (BIT(0))
#define LP_SYSTEM_REG_LP_CORE_DMACTIVE_LPCORE_M  (LP_SYSTEM_REG_LP_CORE_DMACTIVE_LPCORE_V << LP_SYSTEM_REG_LP_CORE_DMACTIVE_LPCORE_S)
#define LP_SYSTEM_REG_LP_CORE_DMACTIVE_LPCORE_V  0x00000001U
#define LP_SYSTEM_REG_LP_CORE_DMACTIVE_LPCORE_S  0

/** LP_SYSTEM_REG_TOUCH_PAD_RTC_EN_AMUX_REG register
 *  TOUCH_PAD_RTC_EN_AMUX register
 */
#define LP_SYSTEM_REG_TOUCH_PAD_RTC_EN_AMUX_REG (DR_REG_LP_SYS_BASE + 0x23c)
/** LP_SYSTEM_REG_TOUCH_PAD_RTC_EN_AMUX : R/W; bitpos: [13:0]; default: 0;
 *  Configures the rtc_en_amux of the touch_pads
 *  amux_reg[13:0] <->TOUCH_GPIO[19:6]
 */
#define LP_SYSTEM_REG_TOUCH_PAD_RTC_EN_AMUX    0x00003FFFU
#define LP_SYSTEM_REG_TOUCH_PAD_RTC_EN_AMUX_M  (LP_SYSTEM_REG_TOUCH_PAD_RTC_EN_AMUX_V << LP_SYSTEM_REG_TOUCH_PAD_RTC_EN_AMUX_S)
#define LP_SYSTEM_REG_TOUCH_PAD_RTC_EN_AMUX_V  0x00003FFFU
#define LP_SYSTEM_REG_TOUCH_PAD_RTC_EN_AMUX_S  0

/** LP_SYSTEM_REG_HP_GPIO_O_HOLD_CTRL1_REG register
 *  NA
 */
#define LP_SYSTEM_REG_HP_GPIO_O_HOLD_CTRL1_REG (DR_REG_LP_SYS_BASE + 0x270)
/** LP_SYSTEM_REG_HP_GPIO_0_HOLD_CTRL1 : R/W; bitpos: [22:0]; default: 0;
 *  hold control for gpio62~40
 */
#define LP_SYSTEM_REG_HP_GPIO_0_HOLD_CTRL1    0x007FFFFFU
#define LP_SYSTEM_REG_HP_GPIO_0_HOLD_CTRL1_M  (LP_SYSTEM_REG_HP_GPIO_0_HOLD_CTRL1_V << LP_SYSTEM_REG_HP_GPIO_0_HOLD_CTRL1_S)
#define LP_SYSTEM_REG_HP_GPIO_0_HOLD_CTRL1_V  0x007FFFFFU
#define LP_SYSTEM_REG_HP_GPIO_0_HOLD_CTRL1_S  0

/** LP_SYSTEM_REG_HP_GPIO_O_HOLD_CTRL0_REG register
 *  NA
 */
#define LP_SYSTEM_REG_HP_GPIO_O_HOLD_CTRL0_REG (DR_REG_LP_SYS_BASE + 0x274)
/** LP_SYSTEM_REG_HP_GPIO_0_HOLD_CTRL0 : R/W; bitpos: [31:0]; default: 0;
 *  hold control for gpio39~8
 */
#define LP_SYSTEM_REG_HP_GPIO_0_HOLD_CTRL0    0xFFFFFFFFU
#define LP_SYSTEM_REG_HP_GPIO_0_HOLD_CTRL0_M  (LP_SYSTEM_REG_HP_GPIO_0_HOLD_CTRL0_V << LP_SYSTEM_REG_HP_GPIO_0_HOLD_CTRL0_S)
#define LP_SYSTEM_REG_HP_GPIO_0_HOLD_CTRL0_V  0xFFFFFFFFU
#define LP_SYSTEM_REG_HP_GPIO_0_HOLD_CTRL0_S  0

#ifdef __cplusplus
}
#endif
